import os.path

# bouding box 颜色
COLORS = (
    (255, 0, 0, 128),
    (0, 255, 0, 128),
    (0, 0, 255, 128),
    (0, 255, 255, 128),
    (255, 0, 255, 128),
    (255, 255, 0, 128)
)

# 数据库平均图色彩值
MEANS = (104, 117, 123)

# SSD300 配置信息

# VOC2007,2012相关的配置信息
voc = {
    "num_class": 21, #类别
    "lr_steps": (80000, 100000, 120000), #学习率衰减的iter数
    "max_iter": 120000, #总共进行的iter数目
    "feature_maps": [38, 19, 10, 5, 3, 1], #每个采样的feature map的大小
    "min_dim": 300, #输入尺寸
    "steps": [8, 16, 32, 64, 100, 300], #???
    "min_sizes": [30, 60, 111, 162, 213, 264], #是根据论文提出的那个 Sk计算的  但是看上去和原来的那个并不一样... 设置的比例是 0.2 - 1.05 (max)最小的那个min 30 是怎么设置的
    "max_sizes": [60, 111, 162, 213, 264, 315], #同上
    "aspect_ratios": [[2], [2, 3], [2, 3], [2, 3], [2], [2]], #不同feature map层的aspect ratio
    "variance": [0.1, 0.2], #???
    "clip": True, #是否进行clip
    "name": "VOC",
}

# COCO的相关配置信息
# 具体信息同上
coco = {
    'num_classes': 201,
    'lr_steps': (280000, 360000, 400000),
    'max_iter': 400000,
    'feature_maps': [38, 19, 10, 5, 3, 1],
    'min_dim': 300,
    'steps': [8, 16, 32, 64, 100, 300],
    'min_sizes': [21, 45, 99, 153, 207, 261],
    'max_sizes': [45, 99, 153, 207, 261, 315],
    'aspect_ratios': [[2], [2, 3], [2, 3], [2, 3], [2], [2]],
    'variance': [0.1, 0.2],
    'clip': True,
    'name': 'COCO',
}